
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"db2fca0ca0c2689e8a2e301fe64310d839aade12b1eb859cbb8009478733cc30\"" -> "W/\"11bedc9e859934a32269d6f8d9a8d952dfcc9d6b0729fdfc4df78390fb1f19f1\""
        id                          = "template-template"
        name                        = "template-template"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"20af48704f672d1994b64350973aaacbbb53432a8afe49d186bf17025a9e7879\"" -> "W/\"3e308334b44ccd9fb75fefdbd52c86684f5e8f4a72960b74892a3ac6a910a9a6\""
        id          = "1252074"
        name        = "protect-main-branch-kong-build-images"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"e5bfec89d6d3ab8aa6bdb21b129c205492e2291490a01e4219d143ddbb846333\"" -> "W/\"16ddee311c0f5d4a70dc147db16eb90b2d43eac0ec892202fe3b13bfc7296746\""
        id          = "1252075"
        name        = "protect-main-branch-template-1-github-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ef5c8349d4111138d26d8d7f0ac3679d2fe13d4d0d80b1d7ded1c4b5d7766e46\"" -> "W/\"ff7edcfeada7bc8f0216f3dad92795622614ec3f8701b3d88948d0addb4cf667\""
        id          = "1252077"
        name        = "protect-main-branch-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"a4d5c6a44094b7a2fa5000656adbe2bcb1b04dd3fc1593e6425aa1695ac9d8a2\"" -> "W/\"1b37d909d23c02e6c5d3214590abfb24ebc6fb6cd6185c51a7a9725eb0de9763\""
        id          = "1252076"
        name        = "protect-main-branch-template-template"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"14c3a9287e164f2fd89acb4c3bb79d91b7153e56dcca3f508a4d4710da79c767\"" -> "W/\"5165a4597d810878c856f9d1a697202229cba56c06ceb2b343a5bd76da321114\""
        id          = "1252078"
        name        = "protect-main-branch-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"17bb7a06e689ca2d8c47d23e48c56f7bf91511417b0771b9a169fcccf94175cf\"" -> "W/\"7b0759599742d9ac6a5c2c0be7d087f4d9903c111953bb1d0fe87f2371453d25\""
        id          = "1252079"
        name        = "protect-main-branch-terraform-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"01ec3e7bc07d1ad79a784d548011d1a9b2400bed6eb21d08bca9d774888934b7\"" -> "W/\"61b16787fce410fe45c2d294d8e9129416d35dc6576d0f19f679e5dc01009744\""
        id          = "1252080"
        name        = "protect-main-branch-terraform-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.settings_all["kong-openssl"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-openssl"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->